[
    {
        "date": "2024-03-15",
        "time": "09:30",
        "max_depth": 30,
        "depth_avg": 20,
        "dive_type": "recreational",
        "location_site": "Blue Corner",
        "location_area": "Palau",
        "location_country": "Palau",
        "dive_length": 45,
        "highlights": "barracuda schools, reef sharks, manta rays, colorful corals, vertical wall",
        "content": "Explored the vibrant coral gardens of Blue Corner, known for its strong currents and pelagic action. The wall dive featured schools of barracuda, reef sharks, and occasional manta rays gliding overhead. Visibility was excellent at 30 meters, allowing for stunning views of the colorful soft corals and gorgonian fans covering the vertical drop-off."
    },
    {
        "date": "2024-04-22",
        "time": "11:00",
        "max_depth": 30,
        "depth_avg": 25,
        "dive_type": "wreck",
        "location_site": "SS Thistlegorm",
        "location_area": "Red Sea",
        "location_country": "Egypt",
        "dive_length": 52,
        "highlights": "WWII wreck, motorcycles, trucks, glassfish, batfish, cargo holds",
        "content": "Wreck dive on the SS Thistlegorm, a World War II cargo ship resting at 30 meters. Explored the cargo holds filled with motorcycles, trucks, and military equipment frozen in time. The wreck is covered in soft corals and home to large schools of glassfish and batfish. Penetrated the engine room and cargo holds with proper training and equipment."
    },
    {
        "date": "2024-05-10",
        "time": "08:00",
        "max_depth": 15,
        "depth_avg": 10,
        "dive_type": "cave",
        "location_site": "Cenote Dos Ojos",
        "location_area": "Tulum",
        "location_country": "Mexico",
        "dive_length": 65,
        "highlights": "stalactites, haloclines, crystal clear water, cave formations, narrow passages",
        "content": "Cave diving in the cenotes of the Yucatan Peninsula. Entered through a small opening into a vast underwater cave system with stunning stalactites and haloclines creating surreal visual effects. The crystal-clear freshwater provided exceptional visibility. Navigated through narrow passages and large chambers, following the guideline carefully."
    },
    {
        "date": "2024-06-05",
        "time": "10:15",
        "max_depth": 18,
        "depth_avg": 12,
        "dive_type": "recreational",
        "location_site": "Manta Point",
        "location_area": "Nusa Penida",
        "location_country": "Indonesia",
        "dive_length": 55,
        "highlights": "manta rays, barrel rolls, cleaning station, current feeding",
        "content": "Shallow reef dive at Manta Point where we encountered multiple manta rays feeding in the current. The mantas performed barrel rolls and graceful loops, coming within meters of us. The site features a cleaning station where smaller fish remove parasites from the mantas. Visibility was moderate but the manta action was incredible."
    },
    {
        "date": "2024-07-18",
        "time": "14:00",
        "max_depth": 40,
        "depth_avg": 30,
        "dive_type": "recreational",
        "location_site": "Great Blue Hole",
        "location_area": "Belize Barrier Reef",
        "location_country": "Belize",
        "dive_length": 38,
        "highlights": "vertical wall, massive sponges, black coral, Caribbean reef sharks, abyss",
        "content": "Deep wall dive along the Great Blue Hole's outer rim. Descended to 40 meters along the vertical wall covered in massive sponges and black coral. Encountered Caribbean reef sharks patrolling the edge. The wall drops dramatically into the abyss, creating an awe-inspiring sense of depth. Required careful attention to depth and bottom time."
    },
    {
        "date": "2024-08-12",
        "time": "20:30",
        "max_depth": 20,
        "depth_avg": 15,
        "dive_type": "recreational",
        "location_site": "House Reef",
        "location_area": "Bonaire",
        "location_country": "Netherlands Antilles",
        "dive_length": 48,
        "highlights": "octopuses, moray eels, bioluminescent plankton, nocturnal fish, night colors",
        "content": "Night dive on the house reef exploring the nocturnal marine life. Discovered octopuses hunting, moray eels out of their holes, and bioluminescent plankton creating trails of light. The reef transforms at night with different fish species active. Used dive lights to illuminate the colorful corals and critters."
    },
    {
        "date": "2024-09-03",
        "time": "13:45",
        "max_depth": 20,
        "depth_avg": 18,
        "dive_type": "wreck",
        "location_site": "USS Kittiwake",
        "location_area": "Grand Cayman",
        "location_country": "Cayman Islands",
        "dive_length": 50,
        "highlights": "wreck penetration, bridge, engine room, colorful corals, grunts, snappers",
        "content": "Wreck penetration dive on the USS Kittiwake, a former submarine rescue vessel intentionally sunk as an artificial reef. Explored the bridge, galley, and engine room with proper overhead environment training. The wreck is now covered in colorful corals and home to schools of grunts and snappers. Excellent visibility and safe penetration routes."
    },
    {
        "date": "2024-10-20",
        "time": "09:00",
        "max_depth": 25,
        "depth_avg": 20,
        "dive_type": "recreational",
        "location_site": "Shark Reef",
        "location_area": "Fiji",
        "location_country": "Fiji",
        "dive_length": 42,
        "highlights": "whitetip reef sharks, gray reef sharks, hammerheads, drift current, cleaning station",
        "content": "Drift dive along the channel at Shark Reef where we encountered multiple species of sharks including whitetip reef sharks, gray reef sharks, and the occasional hammerhead. The strong current carried us along the reef while sharks cruised by. The site features a cleaning station where cleaner wrasse service the sharks."
    },
    {
        "date": "2024-11-08",
        "time": "10:30",
        "max_depth": 18,
        "depth_avg": 12,
        "dive_type": "cave",
        "location_site": "Devil's Den",
        "location_area": "Williston",
        "location_country": "United States",
        "dive_length": 70,
        "highlights": "cave passages, fossil formations, crystal clear water, blind cave fish, permanent line",
        "content": "Cave system exploration in the Florida springs. Navigated through narrow passages and large rooms decorated with ancient fossil formations. The water was crystal clear with excellent visibility. Followed the permanent guideline through the system, observing the unique cave formations and occasional blind cave fish."
    },
    {
        "date": "2024-12-14",
        "time": "08:45",
        "max_depth": 15,
        "depth_avg": 10,
        "dive_type": "recreational",
        "location_site": "Muck Diving Site",
        "location_area": "Lembeh Strait",
        "location_country": "Indonesia",
        "dive_length": 75,
        "highlights": "nudibranchs, seahorses, pipefish, ghost pipefish, muck critters, macro photography",
        "content": "Shallow macro dive searching for rare critters in the muck. Found multiple species of nudibranchs, seahorses, pipefish, and ornate ghost pipefish. The sandy bottom and rubble areas are perfect for spotting well-camouflaged creatures. Used a magnifying glass and good buoyancy to observe the tiny marine life."
    },
    {
        "date": "2025-01-22",
        "time": "11:30",
        "max_depth": 50,
        "depth_avg": 40,
        "dive_type": "decompression",
        "location_site": "Deep Wall",
        "location_area": "Sipadan",
        "location_country": "Malaysia",
        "dive_length": 95,
        "highlights": "deep wall, large groupers, schools of jacks, black coral, gorgonians, technical diving",
        "content": "Deep technical dive requiring decompression stops. Explored a wall that drops beyond 50 meters, encountering large groupers and schools of jacks. The dive required careful gas management and staged decompression. Saw black coral and gorgonians at depth. Excellent visibility allowed for safe navigation during the extended bottom time."
    },
    {
        "date": "2025-02-10",
        "time": "09:15",
        "max_depth": 28,
        "depth_avg": 22,
        "dive_type": "wreck",
        "location_site": "SS Yongala",
        "location_area": "Townsville",
        "location_country": "Australia",
        "dive_length": 50,
        "highlights": "famous wreck, colorful corals, trevally, barracuda, sea snakes, turtles, pelagic life",
        "content": "Wreck dive on the Yongala, one of Australia's most famous wreck dives. The ship is covered in colorful corals and home to massive schools of fish including trevally, barracuda, and batfish. Encountered sea snakes, turtles, and large groupers. The wreck sits in open water, attracting pelagic life. Strong currents require good diving skills."
    },
    {
        "date": "2025-03-05",
        "time": "10:00",
        "max_depth": 22,
        "depth_avg": 16,
        "dive_type": "recreational",
        "location_site": "Coral Gardens",
        "location_area": "Raja Ampat",
        "location_country": "Indonesia",
        "dive_length": 58,
        "highlights": "vibrant corals, anthias, butterflyfish, angelfish, frogfish, photography",
        "content": "Reef dive exploring the vibrant coral gardens teeming with life. Encountered schools of anthias, butterflyfish, and angelfish. The reef features both hard and soft corals in excellent condition. Spotted a rare frogfish camouflaged among the corals. The dive was relaxed with minimal current, perfect for photography."
    },
    {
        "date": "2025-04-18",
        "time": "14:20",
        "max_depth": 20,
        "depth_avg": 15,
        "dive_type": "cave",
        "location_site": "Ginnie Springs",
        "location_area": "High Springs",
        "location_country": "United States",
        "dive_length": 80,
        "highlights": "freshwater springs, interconnected chambers, limestone formations, permanent lines, cave diving",
        "content": "Cave diving in a freshwater spring system with multiple entrances. Navigated through interconnected chambers following the permanent line. The cave features stunning limestone formations and clear visibility. Encountered unique cave-adapted species. Required proper cave diving certification and equipment including redundant air sources."
    },
    {
        "date": "2025-05-12",
        "time": "12:00",
        "max_depth": 25,
        "depth_avg": 20,
        "dive_type": "wreck",
        "location_site": "Cargo Wreck",
        "location_area": "Red Sea",
        "location_country": "Egypt",
        "dive_length": 45,
        "highlights": "wreck penetration, cargo holds, crew quarters, glassfish, groupers, natural lighting",
        "content": "Wreck penetration dive exploring the interior of a sunken cargo ship. Penetrated through cargo holds and crew quarters, observing the ship's structure and marine life that has taken residence. The wreck is well-lit by natural light through openings. Saw schools of glassfish and large groupers inside the wreck."
    },
    {
        "date": "2025-06-08",
        "time": "09:30",
        "max_depth": 12,
        "depth_avg": 8,
        "dive_type": "recreational",
        "location_site": "Beginner's Reef",
        "location_area": "Sharm El Sheikh",
        "location_country": "Egypt",
        "dive_length": 60,
        "highlights": "soft corals, sea fans, clownfish, anemones, parrotfish, triggerfish, beginner friendly",
        "content": "Shallow reef dive perfect for beginners with abundant marine life. The site features colorful soft corals, sea fans, and hard corals in excellent condition. Encountered friendly reef fish including clownfish in anemones, parrotfish, and triggerfish. The dive was calm with excellent visibility and warm water temperature."
    },
    {
        "date": "2025-07-15",
        "time": "11:45",
        "max_depth": 35,
        "depth_avg": 28,
        "dive_type": "recreational",
        "location_site": "Vertical Wall",
        "location_area": "Cozumel",
        "location_country": "Mexico",
        "dive_length": 40,
        "highlights": "vertical drop-off, black coral, gorgonians, tuna, jacks, pelagic species, blue water",
        "content": "Deep wall dive along a vertical drop-off covered in black coral and gorgonians. Encountered pelagic species including tuna and jacks cruising along the wall. The wall drops dramatically into the blue, creating stunning photo opportunities. Required careful depth monitoring and gas management for the deeper sections."
    },
    {
        "date": "2025-08-20",
        "time": "10:15",
        "max_depth": 22,
        "depth_avg": 18,
        "dive_type": "wreck",
        "location_site": "Wreck and Reef",
        "location_area": "Maldives",
        "location_country": "Maldives",
        "dive_length": 55,
        "highlights": "wreck and reef, colorful corals, fish schools, eagle rays, reef sharks",
        "content": "Wreck and reef combination dive exploring both a sunken ship and the surrounding reef. The wreck is covered in colorful corals and home to large schools of fish. The adjacent reef features healthy coral formations and diverse marine life. Spotted eagle rays gliding over the wreck and reef sharks patrolling the area."
    },
    {
        "date": "2025-09-10",
        "time": "13:00",
        "max_depth": 18,
        "depth_avg": 14,
        "dive_type": "cave",
        "location_site": "Cave System",
        "location_area": "Riviera Maya",
        "location_country": "Mexico",
        "dive_length": 72,
        "highlights": "underwater passages, speleothems, narrow sections, blind cave fish, cave formations",
        "content": "Cave system dive exploring underwater passages with stunning formations. Navigated through narrow sections and large rooms, following the permanent guideline. The cave features unique speleothems and clear water. Required proper cave diving training and equipment. Encountered blind cave fish and other cave-adapted organisms."
    },
    {
        "date": "2025-10-05",
        "time": "08:30",
        "max_depth": 25,
        "depth_avg": 20,
        "dive_type": "recreational",
        "location_site": "Current Point",
        "location_area": "Komodo",
        "location_country": "Indonesia",
        "dive_length": 38,
        "highlights": "strong current, manta rays, sharks, pelagic life, healthy corals, drift dive",
        "content": "Reef dive with strong current requiring good diving skills. The current brought in pelagic life including manta rays, sharks, and large schools of fish. The reef itself features healthy corals and abundant reef fish. The dive was exhilarating with the current carrying us along the reef while observing the marine life."
    },
    {
        "date": "2025-11-12",
        "time": "15:00",
        "max_depth": 45,
        "depth_avg": 38,
        "dive_type": "decompression",
        "location_site": "Deep Reef",
        "location_area": "Philippines",
        "location_country": "Philippines",
        "dive_length": 88,
        "highlights": "deep reef, large groupers, snappers, black coral, technical diving, decompression",
        "content": "Technical decompression dive exploring a deep reef structure. Descended to 45 meters where we encountered large groupers, schools of snappers, and black coral formations. The dive required staged decompression stops on ascent. Excellent visibility allowed for safe navigation and observation of the deep reef ecosystem."
    },
    {
        "date": "2025-11-05",
        "time": "11:20",
        "max_depth": 15,
        "depth_avg": 12,
        "dive_type": "wreck",
        "location_site": "Aircraft Wreck",
        "location_area": "Bali",
        "location_country": "Indonesia",
        "dive_length": 50,
        "highlights": "aircraft wreck, cockpit, soft corals, fish schools, shallow water, unique site",
        "content": "Wreck dive on a sunken aircraft, a unique and fascinating dive site. The plane is covered in soft corals and home to schools of small fish. Explored the cockpit area and wings, observing how marine life has colonized the structure. The wreck sits in shallow water making it accessible and well-lit."
    },
    {
        "date": "2025-01-15",
        "time": "09:45",
        "max_depth": 20,
        "depth_avg": 15,
        "dive_type": "recreational",
        "location_site": "Pristine Reef",
        "location_area": "Socorro Islands",
        "location_country": "Mexico",
        "dive_length": 62,
        "highlights": "pristine reef, biodiversity, reef fish, mantis shrimp, nudibranchs, vibrant corals",
        "content": "Reef dive exploring a pristine coral reef with exceptional biodiversity. Encountered multiple species of reef fish, invertebrates, and occasional pelagic visitors. The reef features both hard and soft corals in vibrant colors. Spotted rare critters including mantis shrimp and various nudibranchs. Excellent visibility and calm conditions."
    },
    {
        "date": "2025-02-20",
        "time": "10:00",
        "max_depth": 16,
        "depth_avg": 12,
        "dive_type": "cave",
        "location_site": "Cenote Calavera",
        "location_area": "Tulum",
        "location_country": "Mexico",
        "dive_length": 68,
        "highlights": "light effects, haloclines, light rays, stalactites, crystal clear water, cenote",
        "content": "Cave diving in a cenote with stunning light effects from surface openings. The dive featured haloclines creating visual distortions and beautiful light rays penetrating the water. Navigated through the cave system observing stalactites and unique formations. The freshwater was crystal clear with excellent visibility throughout."
    },
    {
        "date": "2025-03-10",
        "time": "14:30",
        "max_depth": 28,
        "depth_avg": 22,
        "dive_type": "wreck",
        "location_site": "Cargo Ship Wreck",
        "location_area": "Thailand",
        "location_country": "Thailand",
        "dive_length": 48,
        "highlights": "wreck penetration, bridge, engine room, cargo holds, marine life, safe routes",
        "content": "Wreck penetration dive on a large cargo ship with multiple accessible areas. Explored the bridge, engine room, and cargo holds with proper overhead environment protocols. The wreck is well-lit and safe for penetration with clear exit routes. Marine life has colonized all areas of the wreck creating a vibrant ecosystem."
    },
    {
        "date": "2025-04-05",
        "time": "08:15",
        "max_depth": 18,
        "depth_avg": 12,
        "dive_type": "recreational",
        "location_site": "Macro Paradise",
        "location_area": "Anilao",
        "location_country": "Philippines",
        "dive_length": 75,
        "highlights": "macro photography, nudibranchs, seahorses, pipefish, tiny critters, close-up shots",
        "content": "Shallow reef dive perfect for macro photography with abundant small critters. Found multiple species of nudibranchs, seahorses, and pipefish. The reef features healthy corals and excellent conditions for close-up photography. Spent the entire dive slowly exploring and photographing the tiny marine life."
    },
    {
        "date": "2025-05-18",
        "time": "12:00",
        "max_depth": 50,
        "depth_avg": 42,
        "dive_type": "decompression",
        "location_site": "Technical Wall",
        "location_area": "Red Sea",
        "location_country": "Egypt",
        "dive_length": 105,
        "highlights": "technical diving, gas switches, pelagic species, deep-water corals, sponges, planning",
        "content": "Deep technical dive requiring decompression with multiple gas switches. Explored a wall that drops beyond recreational limits, encountering large pelagic species. The dive required careful planning, gas management, and staged decompression. Saw unique deep-water corals and sponges not found in shallower areas."
    },
    {
        "date": "2025-06-12",
        "time": "10:30",
        "max_depth": 20,
        "depth_avg": 15,
        "dive_type": "recreational",
        "location_site": "Crystal Clear Reef",
        "location_area": "Maldives",
        "location_country": "Maldives",
        "dive_length": 58,
        "highlights": "exceptional visibility, healthy corals, anthias, blue-ringed octopus, moray eels",
        "content": "Reef dive with exceptional visibility and abundant marine life. The site features healthy coral formations and diverse fish populations. Encountered schools of anthias, butterflyfish, and angelfish. Spotted a rare blue-ringed octopus and multiple species of moray eels. The dive was relaxed with minimal current."
    },
    {
        "date": "2025-07-08",
        "time": "13:15",
        "max_depth": 22,
        "depth_avg": 16,
        "dive_type": "cave",
        "location_site": "Spring Cave System",
        "location_area": "Florida",
        "location_country": "United States",
        "dive_length": 85,
        "highlights": "freshwater spring, interconnected passages, limestone formations, permanent lines, cave diving",
        "content": "Cave system exploration in a freshwater spring with multiple interconnected passages. Navigated through narrow sections and large rooms following permanent guidelines. The cave features stunning limestone formations and clear water. Required proper cave diving certification and redundant equipment."
    },
    {
        "date": "2025-08-25",
        "time": "11:00",
        "max_depth": 24,
        "depth_avg": 18,
        "dive_type": "wreck",
        "location_site": "Wreck and Reef Combo",
        "location_area": "Caribbean",
        "location_country": "Caribbean",
        "dive_length": 52,
        "highlights": "wreck and reef, soft corals, fish schools, turtles, rays, reef sharks, healthy corals",
        "content": "Wreck and reef combination dive exploring a sunken ship and the surrounding coral reef. The wreck is covered in colorful soft corals and home to large schools of fish. The adjacent reef features healthy hard corals and diverse marine life. Encountered turtles, rays, and reef sharks during the dive."
    }
]

